{
    "id": "plan-5532ef5e-5f3c-4886-9b73-6ce8228301ff",
    "plan_context": {
        "query": "Use PhinTool to navigate to the website and fill in the fields with mandatory field postcode with NW1 8DU, and optional fields following with Cardiology and Return a list of potential doctors and with the extracted fields distance, rating, consultation price, time until next availability, and specialty that are a list of string. Ensure consultation price is low and the time to next availability is not longSuggest the best three suitable doctors for the user and include a brief justificationReturn the result as a json object with the fields 'Name', 'Specialty', 'Price', 'Availability', 'Rating', and 'Justification', each populated accordingly",
        "tool_ids": [
            "calculator_tool",
            "phin_tool",
            "search_tool",
            "weather_tool"
        ]
    },
    "steps": [
        {
            "task": "Fetch data from the PHIN UK site using the mandatory field postcode set to NW1 8DU and optional field specialty set to Cardiology. Extract relevant fields: distance, rating, consultation price, time until next availability, and specialty as a list of strings.",
            "inputs": [],
            "tool_id": "phin_tool",
            "output": "$phin_data",
            "condition": null
        },
        {
            "task": "Analyze the fetched data from PHIN UK site. Ensure consultation price is low and the time to next availability is not long. Suggest the best three suitable doctors based on these criteria and include a brief justification. Return a result as a JSON object with fields 'Name', 'Specialty', 'Price', 'Availability', 'Rating', and 'Justification' each populated accordingly.",
            "inputs": [
                {
                    "name": "$phin_data",
                    "description": "Data from PHIN UK site including distance, rating, consultation price, time until next availability, and specialty."
                }
            ],
            "tool_id": "llm_tool",
            "output": "$best_doctors",
            "condition": null
        }
    ]
}